---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures
source: html/4cd90111-4129-c210-f551-9ebdc20384ba.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures

Failures about StairRamp.

## Syntax (C#)
```csharp
public static class StairRampFailures
```